Repository: gnachman/iTerm2
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: de, ja, pt_br, ru, zh_hans

# AdvancedSetting.urlHandlerCommand
source: Command to run when opening a clicked URL, instead of asking the OS to open it. When non-empty, this command runs as a silent background task via /bin/sh -c whenever you click a URL (including OSC 8 hyperlinks and auto-detected URLs) that iTerm2 would otherwise hand to the system. This is an interpolated string; use \(url) for the URL and \(background) for whether a background open was requested (1 if you held option while clicking, otherwise 0). The command is responsible for opening the URL however it likes (e.g., “open -g \(url)” to open in the background). When empty, URLs open normally. iTerm2-internal schemes (iterm2:), URL schemes bound to a profile, and Semantic History file links are not affected.
de: Befehl, der beim Öffnen einer angeklickten URL ausgeführt wird, statt das Betriebssystem darum zu bitten, sie zu öffnen. Wenn nicht leer, läuft dieser Befehl als stille Hintergrundaufgabe über /bin/sh -c, sobald Sie eine URL anklicken (einschließlich OSC-8-Hyperlinks und automatisch erkannter URLs), die iTerm2 andernfalls an das System übergeben würde. Dies ist eine interpolierte Zeichenfolge; verwenden Sie \(url) für die URL und \(background) dafür, ob ein Öffnen im Hintergrund angefordert wurde (1, wenn beim Klicken die Wahltaste gedrückt gehalten wurde, sonst 0). Der Befehl ist dafür verantwortlich, die URL nach Belieben zu öffnen (z. B. „open -g \(url)“, um im Hintergrund zu öffnen). Wenn leer, werden URLs normal geöffnet. iTerm2-interne Schemata (iterm2:), einem Profil zugeordnete URL-Schemata und Dateilinks der Semantic History sind davon nicht betroffen.
ja: クリックしたURLを開く際に、OSに開かせる代わりに実行するコマンド。 空でない場合、iTerm2がシステムに渡すはずだったURL（OSC 8ハイパーリンクや自動検出されたURLを含む）をクリックするたびに、このコマンドが/bin/sh -c経由でサイレントなバックグラウンドタスクとして実行されます。これは補間文字列であり、URLには\(url)を、バックグラウンドで開くことが要求されたかどうか（クリック時にoptionキーを押していた場合は1、それ以外は0）には\(background)を使用します。このコマンドは、好きな方法でURLを開く責任を負います（例えば、バックグラウンドで開くには「open -g \(url)」など）。空の場合、URLは通常どおり開きます。iTerm2内部のスキーム（iterm2:）、プロファイルに紐付けられたURLスキーム、およびセマンティックヒストリーのファイルリンクには影響しません。
pt_br: Comando a executar ao abrir uma URL clicada, em vez de pedir ao sistema para abri-la. Quando não vazio, este comando é executado como uma tarefa silenciosa em segundo plano via /bin/sh -c sempre que você clica em uma URL (incluindo hyperlinks OSC 8 e URLs detectadas automaticamente) que o iTerm2 normalmente entregaria ao sistema. Esta é uma string interpolada; use \(url) para a URL e \(background) para indicar se uma abertura em segundo plano foi solicitada (1 se você segurou option ao clicar, caso contrário 0). O comando é responsável por abrir a URL como preferir (por exemplo, “open -g \(url)” para abrir em segundo plano). Quando vazio, as URLs abrem normalmente. Esquemas internos do iTerm2 (iterm2:), esquemas de URL vinculados a um perfil e links de arquivos do Semantic History não são afetados.
ru: Команда, которая выполняется при открытии URL по клику, вместо того чтобы поручать это ОС. Если задано, эта команда выполняется как тихая фоновая задача через /bin/sh -c при каждом клике по URL (включая гиперссылки OSC 8 и автоматически распознанные URL), который иначе iTerm2 передал бы системе. Это интерполированная строка; используйте \(url) для URL и \(background) для указания, был ли запрошен фоновый режим открытия (1, если при клике удерживалась клавиша Option, иначе 0). Команда сама отвечает за то, как открыть URL (например, «open -g \(url)» откроет его в фоновом режиме). Если поле пустое, URL открываются как обычно. Это не затрагивает внутренние схемы iTerm2 (iterm2:), схемы URL, привязанные к профилю, и ссылки на файлы Semantic History.
zh_hans: 点击URL后运行的命令，而非让操作系统打开它。 当该值为非空时，每次点击URL（包括OSC 8超链接和自动检测到的URL）都会通过 /bin/sh -c 作为静默后台任务运行此命令。这是插值字符串；使用 \(url) 表示URL，\(background) 表示是否请求后台打开（按选项键点击时为1，否则为0）。该命令可按照任意方式打开URL（例如“open -g \(url)”在后台打开）。当为空时，URL正常打开。iTerm2内部协议、绑定到配置文件的URL协议以及语义历史文件链接不受影响。

# AdvancedSetting.useAdaptiveFrameRate
source: Use adaptive framerate. When throughput is low, the screen will update at 60 frames per second. When throughput is higher, it will drop to a configurable rate (15 fps by default).
de: Adaptive Bildwiederholrate verwenden. Bei geringem Durchsatz wird der Bildschirm mit 60 Bildern pro Sekunde aktualisiert. Bei höherem Durchsatz sinkt sie auf eine konfigurierbare Rate (standardmäßig 15 fps).
ja: アダプティブフレームレートを使用します。 スループットが低い場合、画面は毎秒60フレームで更新されます。スループットが高い場合は、設定可能なレート（デフォルトは15fps）まで低下します。
pt_br: Usar taxa de quadros adaptável. Quando a vazão é baixa, a tela será atualizada a 60 quadros por segundo. Quando a vazão é maior, ela cairá para uma taxa configurável (15 fps por padrão).
ru: Использовать адаптивную частоту кадров. При низкой пропускной способности экран будет обновляться с частотой 60 кадров в секунду. При более высокой пропускной способности частота снизится до настраиваемого значения (по умолчанию 15 кадров в секунду).
zh_hans: 使用自适应帧率。 当吞吐量较低时，屏幕以每秒60帧更新；当吞吐量较高时，可降至可配置速率（默认15 fps）。

# AdvancedSetting.useBlackFillerColorForTmuxInFullScreen
source: Use black for filler area in tmux windows in full screen.
de: Schwarz für den Füllbereich in tmux-Fenstern im Vollbildmodus verwenden.
ja: フルスクリーン時のtmuxウィンドウの余白部分に黒を使用します。
pt_br: Usar preto para a área de preenchimento em janelas do tmux em tela cheia.
ru: Использовать чёрный цвет для заполняющей области в окнах tmux в полноэкранном режиме.
zh_hans: 在tmux窗口全屏模式下使用黑色作为填充区域。

# AdvancedSetting.useColorfgbgFallback
source: Use fallback for COLORFGBG if no exact match found? The COLORFGBG variable indicates the ANSI colors that match the foreground and background colors. If no colors match and this setting is enabled, then the variable will be set to 15;0 to indicate a dark background or 0;15 to indicate a light background.
de: Ersatzwert für COLORFGBG verwenden, wenn keine exakte Übereinstimmung gefunden wird? Die Variable COLORFGBG gibt die ANSI-Farben an, die der Vordergrund- und Hintergrundfarbe entsprechen. Wenn keine Farben übereinstimmen und diese Einstellung aktiviert ist, wird die Variable auf 15;0 gesetzt, um einen dunklen Hintergrund anzuzeigen, oder auf 0;15 für einen hellen Hintergrund.
ja: 完全に一致する色が見つからない場合にCOLORFGBGのフォールバックを使用しますか？ COLORFGBG変数は、前景色と背景色に一致するANSIカラーを示します。一致する色がなく、この設定が有効な場合、暗い背景を示す15;0、または明るい背景を示す0;15に変数が設定されます。
pt_br: Usar um valor alternativo para COLORFGBG se nenhuma correspondência exata for encontrada? A variável COLORFGBG indica as cores ANSI que correspondem às cores de primeiro plano e de plano de fundo. Se nenhuma cor corresponder e este ajuste estiver ativado, a variável será definida como 15;0 para indicar um plano de fundo escuro ou 0;15 para indicar um plano de fundo claro.
ru: Использовать резервное значение для COLORFGBG, если точное совпадение не найдено? Переменная COLORFGBG указывает ANSI-цвета, соответствующие цветам переднего плана и фона. Если ни один цвет не совпадает и этот параметр включён, переменной будет присвоено значение 15;0 для тёмного фона или 0;15 для светлого фона.
zh_hans: 如果未找到完全匹配项，使用fallback for COLORFGBG？ COLORFGBG变量表示与前景和背景颜色匹配的ANSI颜色。如果无颜色匹配且此设置启用，则变量设为15;0表示深色背景，或0;15表示浅色背景。

# AdvancedSetting.useCustomTabBarFontSize
source: Use custom font size for tab labels? See also advanced setting “Custom tab label font size”.
de: Benutzerdefinierte Schriftgröße für Tab-Beschriftungen verwenden? Siehe auch die erweiterte Einstellung „Benutzerdefinierte Schriftgröße für Tab-Beschriftungen“.
ja: タブラベルにカスタムフォントサイズを使用しますか？ 詳細設定の「カスタムタブラベルフォントサイズ」も参照してください。
pt_br: Usar tamanho de fonte personalizado para os rótulos das abas? Veja também o ajuste avançado “Tamanho de fonte personalizado do rótulo da aba”.
ru: Использовать особый размер шрифта для подписей вкладок? См. также дополнительный параметр «Особый размер шрифта подписи вкладки».
zh_hans: 使用自定义字体大小作为标签页标签？ 参见高级设置“自定义标签页标签字体大小”。

# AdvancedSetting.useDivorcedProfileToSplit
source: When splitting a pane, use the profile with local modifications, not the backing profile.
de: Beim Teilen eines Bereichs das Profil mit lokalen Änderungen verwenden, nicht das zugrunde liegende Profil.
ja: ペインを分割する際、バッキングプロファイルではなく、ローカルで変更されたプロファイルを使用します。
pt_br: Ao dividir um painel, usar o perfil com modificações locais, não o perfil de origem.
ru: При разделении панели использовать профиль с локальными изменениями, а не исходный (базовый) профиль.
zh_hans: 分割窗格时，使用带有本地修改的配置文件，而非背景配置文件。

# AdvancedSetting.useDoubleClickDelayForCommandSelection
source: Wait to be sure it's not a double click before selecting a command
de: Warten, um sicherzustellen, dass es kein Doppelklick ist, bevor ein Befehl ausgewählt wird
ja: コマンドを選択する前に、ダブルクリックでないことを確認するために待機します
pt_br: Esperar para ter certeza de que não é um clique duplo antes de selecionar um comando
ru: Ждать, чтобы убедиться, что это не двойной клик, перед выбором команды
zh_hans: 在选择命令前请等待确认不是双击操作。

# AdvancedSetting.useExperimentalFontMetrics
source: Use a more theoretically correct technique to measure line height. You must restart iTerm2 or adjust a session's font size for this change to take effect.
de: Eine theoretisch korrektere Methode zur Messung der Zeilenhöhe verwenden. Sie müssen iTerm2 neu starten oder die Schriftgröße einer Sitzung anpassen, damit diese Änderung wirksam wird.
ja: 行の高さを測定する際に、より理論的に正確な手法を使用します。 この変更を反映するには、iTerm2を再起動するか、セッションのフォントサイズを調整する必要があります。
pt_br: Usar uma técnica teoricamente mais correta para medir a altura da linha. Você deve reiniciar o iTerm2 ou ajustar o tamanho da fonte de uma sessão para que esta alteração tenha efeito.
ru: Использовать более теоретически корректный способ измерения высоты строки. Чтобы изменение вступило в силу, перезапустите iTerm2 или измените размер шрифта сеанса.
zh_hans: 使用更理论正确的测量行高方法。 必须重启iTerm2或调整会话字体大小才能使此更改生效。

# AdvancedSetting.useGCDUpdateTimer
source: Use GCD-based update timer instead of NSTimer. This should cause more regular screen updates. Restart iTerm2 after changing this setting.
de: GCD-basierten Aktualisierungstimer statt NSTimer verwenden. Dies sollte zu regelmäßigeren Bildschirmaktualisierungen führen. Starten Sie iTerm2 nach Ändern dieser Einstellung neu.
ja: NSTimerの代わりにGCDベースの更新タイマーを使用します。 これにより、画面の更新がより規則的になるはずです。この設定を変更した後はiTerm2を再起動してください。
pt_br: Usar um timer de atualização baseado em GCD em vez de NSTimer. Isso deve resultar em atualizações de tela mais regulares. Reinicie o iTerm2 após alterar este ajuste.
ru: Использовать таймер обновления на основе GCD вместо NSTimer. Это должно сделать обновления экрана более регулярными. После изменения этого параметра перезапустите iTerm2.
zh_hans: 使用基于GCD的更新计时器代替NSTimer。 应实现更规律的屏幕更新。更改此设置后需重启iTerm2。

# AdvancedSetting.useLowPowerGPUWhenUnplugged
source: Metal renderer uses integrated GPU when not connected to power? For this to be effective you must disable “Disable Metal renderer when not connected to power”.
de: Verwendet der Metal-Renderer die integrierte GPU, wenn nicht am Stromnetz angeschlossen? Damit dies wirksam wird, müssen Sie „Metal-Renderer deaktivieren, wenn nicht am Stromnetz angeschlossen“ deaktivieren.
ja: 電源に接続されていないとき、Metalレンダラーは統合GPUを使用しますか？ これを有効にするには、「電源に接続されていないときにMetalレンダラーを無効にする」をオフにする必要があります。
pt_br: O renderizador Metal usa a GPU integrada quando não conectado à energia? Para que isso seja efetivo, você deve desativar “Desativar o renderizador Metal quando não conectado à energia”.
ru: Использовать ли встроенный GPU для рендеринга Metal, когда питание не подключено? Чтобы это работало, нужно отключить параметр «Отключать рендерер Metal, когда питание не подключено».
zh_hans: 未连接电源时，Metal渲染器是否使用集成GPU？ 要生效需禁用“未连接电源时禁用Metal渲染器”。

# AdvancedSetting.useModernScrollWheelAccumulator
source: Use modern scroll wheel accumulator. This should support wheel mice better and feel more natural.
de: Modernen Scrollrad-Akkumulator verwenden. Dies sollte Mäuse mit Scrollrad besser unterstützen und sich natürlicher anfühlen.
ja: モダンなスクロールホイールアキュムレーターを使用します。 これにより、ホイールマウスのサポートが向上し、より自然な操作感になるはずです。
pt_br: Usar o acumulador moderno da roda de rolagem. Isso deve dar melhor suporte a mouses com roda e parecer mais natural.
ru: Использовать современный накопитель прокрутки колёсиком мыши. Это должно лучше поддерживать мыши с колёсиком и ощущаться более естественно.
zh_hans: 使用现代滚动滚轮累积值。 应更好地支持滚轮鼠标，并提供更自然的体验。

# AdvancedSetting.useMultiPassUnderlineRenderer
source: Use multi-pass underline renderer? Fixes underline gaps with ligature fonts. Requires restart.
de: Mehrstufigen Unterstreichungs-Renderer verwenden? Behebt Lücken in Unterstreichungen bei Schriften mit Ligaturen. Erfordert einen Neustart.
ja: マルチパス方式の下線レンダラーを使用しますか？ 合字フォントでの下線の途切れを修正します。再起動が必要です。
pt_br: Usar o renderizador de sublinhado de múltiplas passagens? Corrige lacunas de sublinhado com fontes com ligaduras. Requer reinicialização.
ru: Использовать многопроходный рендерер подчёркивания? Исправляет разрывы в подчёркивании при использовании шрифтов с лигатурами. Требует перезапуска.
zh_hans: 使用多通道下划线渲染器？ 可修复带连字字体时的下划线间隙问题。需要重启。

# AdvancedSetting.useNewContentFormat
source: Save unlimited amount of window contents. This is going to be slow unless you enable SQLite-based window restoration too.
de: Unbegrenzte Menge an Fensterinhalten speichern. Dies wird langsam sein, es sei denn, Sie aktivieren auch die SQLite-basierte Fensterwiederherstellung.
ja: ウィンドウの内容を無制限に保存します。 SQLiteベースのウィンドウ復元も有効にしない限り、動作が遅くなります。
pt_br: Salvar uma quantidade ilimitada de conteúdo de janela. Isso será lento a menos que você também ative a restauração de janelas baseada em SQLite.
ru: Сохранять неограниченный объём содержимого окна. Это будет медленно работать, если также не включить восстановление окон на основе SQLite.
zh_hans: 保存无限量的窗口内容。 除非同时启用基于 SQLite 的窗口恢复功能，否则这会很慢。

# AdvancedSetting.useOldStyleDropDownViews
source: Use old-style find and paste progress indicator views. This change will only affect new windows.
de: Fortschrittsanzeigen im alten Stil für Suchen und Einfügen verwenden. Diese Änderung wirkt sich nur auf neue Fenster aus.
ja: 従来スタイルの検索とペーストの進行状況インジケータービューを使用します。 この変更は新しいウィンドウにのみ影響します。
pt_br: Usar as visualizações antigas de indicador de progresso de busca e colagem. Esta alteração só afetará janelas novas.
ru: Использовать индикаторы прогресса поиска и вставки в старом стиле. Это изменение затронет только новые окна.
zh_hans: 使用旧式的 find 和 paste 进度指示器视图。 此更改仅影响新窗口。

# AdvancedSetting.useOpenDirectory
source: Use Open Directory to determine the user shell
de: Open Directory verwenden, um die Benutzer-Shell zu bestimmen
ja: ユーザーシェルを判別するためにOpen Directoryを使用する
pt_br: Usar o Open Directory para determinar o shell do usuário
ru: Использовать Open Directory для определения оболочки пользователя
zh_hans: 使用“打开目录”来确定用户 shell。

# AdvancedSetting.useRestorableStateController
source: Enable restorable state controller? This makes window restoration more reliable.
de: Controller für den wiederherstellbaren Zustand aktivieren? Dies macht die Fensterwiederherstellung zuverlässiger.
ja: 復元可能な状態コントローラーを有効にしますか？ これにより、ウィンドウの復元がより確実になります。
pt_br: Ativar o controlador de estado restaurável? Isso torna a restauração de janelas mais confiável.
ru: Включить контроллер восстанавливаемого состояния? Это делает восстановление окон более надёжным.
zh_hans: 启用可恢复状态控制器？ 这会使窗口恢复更加可靠。

# AdvancedSetting.userNotificationTriggerRateLimit
source: Rate limit for Notification triggers. If the same trigger fires with less than this time interval (in seconds) between firings, it will be suppressed.
de: Ratenbegrenzung für Benachrichtigungs-Trigger. Wenn derselbe Trigger mit weniger als diesem Zeitintervall (in Sekunden) zwischen den Auslösungen feuert, wird er unterdrückt.
ja: 通知トリガーのレート制限。 同じトリガーがこの時間間隔（秒単位）より短い間隔で発火した場合、抑制されます。
pt_br: Limite de taxa para gatilhos de Notificação. Se o mesmo gatilho disparar com um intervalo menor que este (em segundos) entre disparos, ele será suprimido.
ru: Ограничение частоты для триггеров уведомлений. Если один и тот же триггер срабатывает с интервалом меньше указанного (в секундах), срабатывание будет подавлено.
zh_hans: 通知触发器的速率限制。 如果同一触发器在小于指定时间间隔（以秒为单位）的间隔内再次触发，则会被抑制。

# AdvancedSetting.useSequoiaStyleTabs
source: Use Sequoia-style tabs in Tahoe and later?
de: Tabs im Sequoia-Stil in Tahoe und neuer verwenden?
ja: Tahoeおよびそれ以降でSequoiaスタイルのタブを使用しますか？
pt_br: Usar abas no estilo Sequoia no Tahoe e posteriores?
ru: Использовать вкладки в стиле Sequoia в Tahoe и более поздних версиях?
zh_hans: 在 Tahoe 及更高版本中是否使用 Sequoia 风格的标签页？

# AdvancedSetting.useShortcutAccessoryViewController
source: Show window number in titlebar accessory?
de: Fensternummer im Titelleisten-Zubehör anzeigen?
ja: タイトルバーアクセサリにウィンドウ番号を表示しますか？
pt_br: Mostrar o número da janela no acessório da barra de título?
ru: Показывать номер окна в дополнительном элементе заголовка окна?
zh_hans: 在标题栏附件中显示窗口编号？

# AdvancedSetting.useSystemCursorWhenPossible
source: Use system cursor icons when possible.
de: Wenn möglich, Systemcursorsymbole verwenden.
ja: 可能な場合はシステムのカーソルアイコンを使用します。
pt_br: Usar ícones de cursor do sistema quando possível.
ru: Использовать системные значки курсора, когда это возможно.
zh_hans: 尽可能使用系统光标图标。

# AdvancedSetting.useUnevenTabs
source: Uneven tab widths allowed.
de: Ungleiche Tab-Breiten zulässig.
ja: タブの幅が不均一になることを許可します。
pt_br: Larguras de aba desiguais permitidas.
ru: Разрешена неравномерная ширина вкладок.
zh_hans: 允许不对称的标签页宽度。

# AdvancedSetting.useVirtualKeyCodesForDetectingDigits
source: Treat the top row of keys like number keys on an English keyboard for the purposes of switching panes, tabs, and windows with modifier+number. For example, AZERTY requires you to hold down Shift to enter a number. To switch tabs with ⌘+Number on an AZERTY keyboard, you must enable this setting. Then, for example, ⌘-& switches to tab 1. When this setting is enabled, some user-defined shortcuts may become unavailable because the tab/window/pane switching behavior takes precedence.
de: Die oberste Tastenreihe wie Zifferntasten auf einer englischen Tastatur behandeln, um Bereiche, Tabs und Fenster mit Modifizierer+Zahl zu wechseln. Bei AZERTY müssen Sie beispielsweise die Umschalttaste gedrückt halten, um eine Zahl einzugeben. Um mit ⌘+Zahl auf einer AZERTY-Tastatur zwischen Tabs zu wechseln, müssen Sie diese Einstellung aktivieren. Dann wechselt zum Beispiel ⌘-& zu Tab 1. Wenn diese Einstellung aktiviert ist, sind manche benutzerdefinierten Tastenkombinationen eventuell nicht mehr verfügbar, da das Wechseln von Tabs/Fenstern/Bereichen Vorrang hat.
ja: 修飾キー+数字でペイン、タブ、ウィンドウを切り替える際、キーボード最上段のキーを英語キーボードの数字キーとして扱います。 例えば、AZERTYキーボードでは数字を入力するのにShiftキーを押す必要があります。AZERTYキーボードで⌘+数字によるタブ切り替えを行うには、この設定を有効にする必要があります。有効にすると、例えば⌘-&でタブ1に切り替わります。この設定を有効にすると、タブ/ウィンドウ/ペインの切り替え動作が優先されるため、一部のユーザー定義のショートカットが使用できなくなる場合があります。
pt_br: Tratar a linha superior de teclas como teclas numéricas em um teclado inglês para fins de troca de painéis, abas e janelas com modificador+número. Por exemplo, o AZERTY exige que você segure Shift para digitar um número. Para trocar de aba com ⌘+número em um teclado AZERTY, você deve ativar este ajuste. Então, por exemplo, ⌘-& troca para a aba 1. Quando este ajuste está ativado, alguns atalhos definidos pelo usuário podem ficar indisponíveis porque o comportamento de troca de aba/janela/painel tem precedência.
ru: Рассматривать верхний ряд клавиш как цифровые клавиши английской раскладки для переключения панелей, вкладок и окон с помощью модификатора и цифры. Например, раскладка AZERTY требует удерживать Shift для ввода цифры. Чтобы переключать вкладки с помощью ⌘+цифра на клавиатуре AZERTY, включите этот параметр. Тогда, например, ⌘-& переключит на вкладку 1. Если этот параметр включён, некоторые пользовательские сочетания клавиш могут стать недоступны, поскольку переключение вкладок, окон и панелей имеет приоритет.
zh_hans: 将顶部键行视为英语键盘上的数字键，用于通过修饰键+数字来切换窗格、标签页和窗口。 例如，AZERTY 需要按住 Shift 输入数字。要在 AZERTY 键盘上使用 ⌘+数字切换标签页，必须启用此设置。然后，例如 ⌘-& 会切换到第 1 个标签页。当此设置被启用时，一些用户自定义快捷方式可能不可用，因为标签页/窗口/窗格的切换行为优先。

# AdvancedSetting.uvManifestDownloadURL
source: URL of the uv download manifest (used when the Python runtime is provisioned with uv).
de: URL des uv-Download-Manifests (wird verwendet, wenn die Python-Laufzeitumgebung mit uv bereitgestellt wird).
ja: uvダウンロードマニフェストのURL（Pythonランタイムをuvでプロビジョニングする際に使用されます）。
pt_br: URL do manifesto de download do uv (usado quando o ambiente de execução Python é provisionado com uv).
ru: URL манифеста загрузки uv (используется, когда среда выполнения Python подготавливается с помощью uv).
zh_hans: uv 下载清单的 URL（当 Python 运行时使用 uv 时适用）。

# AdvancedSetting.validCharactersInSSHUserNames
source: Valid characters in SSH user names Alphanumerics are always valid. This specifies other valid characters.
de: Gültige Zeichen in SSH-Benutzernamen Alphanumerische Zeichen sind immer gültig. Dies legt weitere gültige Zeichen fest.
ja: SSHユーザー名で有効な文字 英数字は常に有効です。これは、それ以外に有効な文字を指定します。
pt_br: Caracteres válidos em nomes de usuário SSH Caracteres alfanuméricos são sempre válidos. Isto especifica outros caracteres válidos.
ru: Допустимые символы в именах пользователей SSH Буквы и цифры всегда допустимы. Здесь указываются остальные допустимые символы.
zh_hans: SSH 用户名中有效的字符。 字母数字始终有效。此处指定了其他有效字符。

# AdvancedSetting.verticalBarCursorWidth
source: Width of vertical bar cursor.
de: Breite des vertikalen Balkencursors.
ja: 縦棒カーソルの幅。
pt_br: Largura do cursor de barra vertical.
ru: Ширина курсора-вертикальной черты.
zh_hans: 垂直栏光标的宽度。

# AdvancedSetting.viewManPageCommand
source: Command to view man pages. Used when you press the man page button on the touch bar. %@ is replaced with the command. End the command with & to avoid opening an iTerm2 window (e.g., if you're launching an external viewer).
de: Befehl zum Anzeigen von Man-Pages. Wird verwendet, wenn Sie die Man-Page-Schaltfläche auf der Touch Bar drücken. %@ wird durch den Befehl ersetzt. Beenden Sie den Befehl mit &, um zu verhindern, dass sich ein iTerm2-Fenster öffnet (z. B. wenn Sie einen externen Viewer starten).
ja: manページを表示するためのコマンド。 Touch Barのmanページボタンを押したときに使用されます。%@はコマンドに置き換えられます。iTerm2のウィンドウが開かないようにするには、コマンドの末尾に&を付けてください（外部ビューアーを起動する場合など）。
pt_br: Comando para visualizar páginas de manual. Usado quando você pressiona o botão de página de manual na touch bar. %@ é substituído pelo comando. Termine o comando com & para evitar abrir uma janela do iTerm2 (por exemplo, se você estiver iniciando um visualizador externo).
ru: Команда для просмотра man-страниц. Используется при нажатии кнопки man-страницы на Touch Bar. %@ заменяется командой. Завершите команду знаком &, чтобы избежать открытия окна iTerm2 (например, если вы запускаете внешнюю программу просмотра).
zh_hans: 查看 man 页面命令。 当点击触摸栏上的 man 页面按钮时使用。%@ 被替换为命令，以 & 结束命令可避免打开 iTerm2 窗口（例如，如果正在启动外部查看器）。

# AdvancedSetting.vs16Supported
source: Support variation selector 16 making emoji fullwidth in all modes?
de: Unterstützung dafür, dass Variationsselektor 16 Emojis in allen Modi in voller Breite darstellt?
ja: すべてのモードで、絵文字を全角にする異体字セレクター16をサポートしますか？
pt_br: Suportar o seletor de variação 16 tornando os emoji de largura total em todos os modos?
ru: Поддерживать селектор вариации 16, делающий эмодзи полноширинными во всех режимах?
zh_hans: 是否支持变化选择器 16 使表情符号在所有模式下都全宽显示？

# AdvancedSetting.vs16SupportedInPrimaryScreen
source: Support variation selector 16 making emoji fullwidth outside of alternate screen mode?
de: Unterstützung dafür, dass Variationsselektor 16 Emojis außerhalb des alternativen Bildschirmmodus in voller Breite darstellt?
ja: 代替スクリーンモード以外で、絵文字を全角にする異体字セレクター16をサポートしますか？
pt_br: Suportar o seletor de variação 16 tornando os emoji de largura total fora do modo de tela alternativa?
ru: Поддерживать селектор вариации 16, делающий эмодзи полноширинными вне режима альтернативного экрана?
zh_hans: 在替代屏幕模式之外，是否支持变化选择器 16 使表情符号全宽显示？
